### Connecting to MySQL Database

In [1]:
# Install or upgrade the 'jupysql' package for running SQL queries in Jupyter
!pip install jupysql --upgrade -q

In [2]:
# Configure SQL Magic to display all query results without limiting the output
%config SqlMagic.displaylimit = None

In [3]:
# Load the SQL extension to enable SQL queries within the Jupyter notebook

%load_ext sql

displaylimit: Value None will be treated as 0 (no limit)

Deploy Streamlit apps for free on Ploomber Cloud! Learn more: https://ploomber.io/s/signup

In [4]:
# Load the SQL extension for the notebook and connect to the MySQL database
%sql mysql+pymysql://root:salomeK2020!@localhost:3306/md_water_services

Connecting to 'mysql+pymysql://root:***@localhost:3306/md_water_services'

In [5]:
%%sql
SHOW TABLES

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

8 rows affected.

+-----------------------------+
| Tables_in_md_water_services |
+-----------------------------+
|       data_dictionary       |
|           employee          |
|     global_water_access     |
|           location          |
|            visits           |
|        water_quality        |
|         water_source        |
|        well_pollution       |
+-----------------------------+

#### Data Cleaning

In [6]:
%%sql
# Updating a Email Column
SELECT
    *
FROM
    employee
LIMIT
    5

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+----------------------+----------------+--------------+-------------------------------+-------------------------+---------------+-----------+----------------+
| assigned_employee_id | employee_name  | phone_number |             email             |         address         | province_name | town_name |    position    |
+----------------------+----------------+--------------+-------------------------------+-------------------------+---------------+-----------+----------------+
|          0           |  Amara Jengo   | +99637993287 |   amara.jengo@ndogowater.gov  | 36 Pwani Mchangani Road |     Sokoto    |   Ilanga  | Field Surveyor |
|          1           |  Bello Azibo   | +99643864786 |   bello.azibo@ndogowater.gov  |  129 Ziwa La Kioo Road  |    Kilimani   |   Rural   | Field Surveyor |
|          2           |  Bakari Iniko  | +99222599041 |  bakari.iniko@ndogowater.gov  |  18 Mlima Tazama Avenue |    Hawassa    |   Rural   | Field Surveyor |
|          3           | Malachi Mavuso | +99945849900 | malachi.mavuso@ndogowater.gov |    100 Mogadishu Road   |     Akatsi    |   Lusaka  | Field Surveyor |
|          4           |  Cheche Buhle  | +99381679640 |  cheche.buhle@ndogowater.gov  |     1 Savanna Street    |     Akatsi    |   Rural   | Field Surveyor |
+----------------------+----------------+--------------+-------------------------------+-------------------------+---------------+-----------+----------------+

In [7]:
%%sql
SELECT 
    CONCAT(
    LOWER(REPLACE (employee_name, ' ', '.')),'@ndogowater.gov') # adding the email affix
FROM
    employee
LIMIT
    2

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2 rows affected.

+-----------------------------------------------------------------+
|                                 CONCAT(
    LOWER(REPLACE (employee_name, ' ', '.')),'@ndogowater.gov')                                 |
+-----------------------------------------------------------------+
|                    amara.jengo@ndogowater.gov                   |
|                    bello.azibo@ndogowater.gov                   |
+-----------------------------------------------------------------+

In [8]:
%%sql
UPDATE employee
SET email = CONCAT(
    LOWER(REPLACE (employee_name, ' ', '.')),'@ndogowater.gov')

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

56 rows affected.

++
||
++
++

In [9]:
%%sql
SELECT 
    *
FROM
    employee
LIMIT
    2

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2 rows affected.

+----------------------+---------------+--------------+----------------------------+-------------------------+---------------+-----------+----------------+
| assigned_employee_id | employee_name | phone_number |           email            |         address         | province_name | town_name |    position    |
+----------------------+---------------+--------------+----------------------------+-------------------------+---------------+-----------+----------------+
|          0           |  Amara Jengo  | +99637993287 | amara.jengo@ndogowater.gov | 36 Pwani Mchangani Road |     Sokoto    |   Ilanga  | Field Surveyor |
|          1           |  Bello Azibo  | +99643864786 | bello.azibo@ndogowater.gov |  129 Ziwa La Kioo Road  |    Kilimani   |   Rural   | Field Surveyor |
+----------------------+---------------+--------------+----------------------------+-------------------------+---------------+-----------+----------------+

##### UPDATING the Phone Number Column

In [10]:
%%sql
#The phone numbers should be 12 characters long, consisting of the plus sign, area code (99), and the phone number digits.
SELECT
    LENGTH (phone_number)
FROM
    employee
LIMIT 
    5

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+-----------------------+
| LENGTH (phone_number) |
+-----------------------+
|           12          |
|           12          |
|           12          |
|           12          |
|           12          |
+-----------------------+

However, when we use the LENGTH(column) function, it returns 13 characters, indicating there's an extra character.

That's because there is a space at the end of the number! If you try to send an automated SMS to that number it will fail. This happens so often that they create a function, especially for trimming off the space, called TRIM(column).

In [11]:
%%sql
UPDATE employee
SET phone_number=TRIM(phone_number)

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

56 rows affected.

++
||
++
++

In [12]:
%%sql
#confirming the updated phone number
SELECT
    LENGTH (phone_number)
FROM
    employee
LIMIT 
    5

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+-----------------------+
| LENGTH (phone_number) |
+-----------------------+
|           12          |
|           12          |
|           12          |
|           12          |
|           12          |
+-----------------------+

### Honouring the workers
* Before we dive into the analysis, let's get you warmed up a bit!
* Let's have a look at where our employees live.

Use the employee table to count how many of our employees live in each town. Think carefully about what function we should use and how we should aggregate the data.

In [13]:
%%sql
SELECT
    town_name,
    COUNT(assigned_employee_id) AS number_of_employees
FROM
    employee
GROUP BY
    town_name
LIMIT 
    5

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+-----------+---------------------+
| town_name | number_of_employees |
+-----------+---------------------+
|   Ilanga  |          3          |
|   Rural   |          29         |
|   Lusaka  |          4          |
|  Zanzibar |          4          |
|   Dahabu  |          6          |
+-----------+---------------------+

Most of our employees live in rural areas of Maji Ndogo

Pres. Naledi congratulated the team for completing the survey, but we would not have this data were it not for our field workers. So let's gather some data on their performance in this process, so we can thank those who really put all their effort in.

Pres. Naledi has asked we send out an email or message congratulating the top 3 field surveyors. So let's use the database to get the employee_ids and use those to get the names, email and phone numbers of the three field surveyors with the most location visits.

In [14]:
%%sql
#Let's first look at the number of records each employee collected. 
# So find the correct table, figure out what function to use and how to group, order
# and limit the results to only see the top 3 employee_ids with the highest number of locations visited.
SELECT
    assigned_employee_id,
    COUNT(visit_count) AS num_of_visits
FROM
    visits
GROUP BY
    assigned_employee_id
ORDER BY
    num_of_visits DESC
LIMIT
    3

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+----------------------+---------------+
| assigned_employee_id | num_of_visits |
+----------------------+---------------+
|          1           |      3708     |
|          30          |      3676     |
|          34          |      3539     |
+----------------------+---------------+

Make a note of the top 3 assigned_employee_id and use them to create a query that looks up the employee's info. Since you're a pro at finding stuff in a database now, you can figure this one out. You should have a column of names, email addresses and phone numbers for our top dogs.

In [15]:
%%sql
SELECT employee_name, email, phone_number
FROM employee
WHERE assigned_employee_id IN (1, 30, 34)

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+---------------+----------------------------+--------------+
| employee_name |           email            | phone_number |
+---------------+----------------------------+--------------+
|  Bello Azibo  | bello.azibo@ndogowater.gov | +99643864786 |
|   Pili Zola   |  pili.zola@ndogowater.gov  | +99822478933 |
|   Rudo Imani  | rudo.imani@ndogowater.gov  | +99046972648 |
+---------------+----------------------------+--------------+

### Analyzing Location
Looking at the location table, letâ€™s focus on the province_name, town_name and location_type to understand where the water sources are in Maji Ndogo.

**Number of records per town**

In [16]:
%%sql
SELECT
    town_name, COUNT(location_id) As Number_of_records
FROM
    location
GROUP BY 
    town_name
ORDER BY 
    Number_of_records DESC
LIMIT
    5

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+-----------+-------------------+
| town_name | Number_of_records |
+-----------+-------------------+
|   Rural   |       23740       |
|   Harare  |        1650       |
|   Amina   |        1090       |
|   Lusaka  |        1070       |
|   Mrembo  |        990        |
+-----------+-------------------+

**Number of records per Province**

In [17]:
%%sql
SELECT
    province_name, COUNT(location_id) As Number_of_records
FROM
    location
GROUP BY 
    province_name
ORDER BY 
    Number_of_records DESC
LIMIT
    5

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+---------------+-------------------+
| province_name | Number_of_records |
+---------------+-------------------+
|    Kilimani   |        9510       |
|     Akatsi    |        8940       |
|     Sokoto    |        8220       |
|     Amanzi    |        6950       |
|    Hawassa    |        6030       |
+---------------+-------------------+

From this table, it's pretty clear that most of the water sources in the survey are situated in small rural communities, scattered across Maji Ndogo.
If we count the records for each province, most of them have a similar number of sources, so every province is well-represented in the survey.

Can you find a way to do the following:
1. Create a result set showing:
* province_name
* town_name
* An aggregated count of records for each town (consider naming this records_per_town).
* Ensure your data is grouped by both province_name and town_name.
2. Order your results primarily by province_name. Within each province, further sort the towns by their record counts in descending order.

In [18]:
%%sql
SELECT
    province_name, town_name, COUNT(location_id) As records_per_town
FROM
    location
GROUP BY 
    province_name, town_name
ORDER BY 
    province_name, records_per_town DESC
LIMIT
    5

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+---------------+-----------+------------------+
| province_name | town_name | records_per_town |
+---------------+-----------+------------------+
|     Akatsi    |   Rural   |       6290       |
|     Akatsi    |   Lusaka  |       1070       |
|     Akatsi    |   Harare  |       800        |
|     Akatsi    |  Kintampo |       780        |
|     Amanzi    |   Rural   |       3100       |
+---------------+-----------+------------------+

These results show us that our field surveyors did an excellent job of documenting the status of our country's water crisis. Every province and town has many documented sources.
This makes me confident that the data we have is reliable enough to base our decisions on. This is an insight we can use to communicate data integrity, so let's make a note of that.

**Finally, look at the number of records for each location type**

In [19]:
%%sql
SELECT
    location_type, COUNT(location_id) As Number_of_records
FROM
    location
GROUP BY 
    1
ORDER BY 
   2

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2 rows affected.

+---------------+-------------------+
| location_type | Number_of_records |
+---------------+-------------------+
|     Urban     |       15910       |
|     Rural     |       23740       |
+---------------+-------------------+

We can see that there are more rural sources than urban, but it's really hard to understand those numbers. Percentages are more relatable.
If we use SQL as a very overpowered calculator:

In [20]:
%%sql
SELECT ROUND (23740 / (15910 + 23740) * 100),2

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+---------------------------------------+---+
| ROUND (23740 / (15910 + 23740) * 100) | 2 |
+---------------------------------------+---+
|                   60                  | 2 |
+---------------------------------------+---+

So again, what are some of the insights we gained from the location table?
1. Our entire country was properly canvassed, and our dataset represents the situation on the ground.
2. 60% of our water sources are in rural communities across Maji Ndogo. We need to keep this in mind when we make decisions.

#### DIVING INTO SOURCES
Ok, water_source is a big table, with lots of stories to tell, so strap in!

Before I go and spoil it all, open up the table, look at the various columns, make some notes on what we can do with them, and go ahead and make some queries and explore the dataset. Perhaps you see something I don't.

In [21]:
%%sql
SELECT
    *
FROM
    water_source
LIMIT
    5

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+--------------+----------------------+-------------------------+
|  source_id   | type_of_water_source | number_of_people_served |
+--------------+----------------------+-------------------------+
| AkHa00000224 |     tap_in_home      |           956           |
| AkHa00001224 |  tap_in_home_broken  |           930           |
| AkHa00002224 |  tap_in_home_broken  |           486           |
| AkHa00003224 |         well         |           364           |
| AkHa00004224 |  tap_in_home_broken  |           942           |
+--------------+----------------------+-------------------------+

The way I look at this table; we have access to different water source types and the number of people using each source.
These are the questions that I am curious about.
1. How many people did we survey in total?
2. How many wells, taps and rivers are there?
3. How many people share particular types of water sources on average?
4. How many people are getting water from each type of source?

In [22]:
%%sql
#Number of People Surveyed
SELECT
    SUM(number_of_people_served) AS number_of_people_served
FROM 
    water_source

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+-------------------------+
| number_of_people_served |
+-------------------------+
|         27628140        |
+-------------------------+

In [23]:
%%sql
#How many wells, taps and rivers are there?
SELECT
    type_of_water_source,
    COUNT(type_of_water_source) number_of_sources
FROM
    water_source
GROUP BY 1
ORDER BY 2 DESC

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+----------------------+-------------------+
| type_of_water_source | number_of_sources |
+----------------------+-------------------+
|         well         |       17383       |
|     tap_in_home      |        7265       |
|  tap_in_home_broken  |        5856       |
|      shared_tap      |        5767       |
|        river         |        3379       |
+----------------------+-------------------+

In [24]:
%%sql
#What is the average number of people that are served by each water source? Remember to make the numbers easy to read.
SELECT
    type_of_water_source, ROUND (AVG(number_of_people_served),0) AS average_people_served
FROM
    water_source
GROUP BY 1
ORDER BY 2 DESC

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+----------------------+-----------------------+
| type_of_water_source | average_people_served |
+----------------------+-----------------------+
|      shared_tap      |          2071         |
|        river         |          699          |
|  tap_in_home_broken  |          649          |
|     tap_in_home      |          644          |
|         well         |          279          |
+----------------------+-----------------------+

These results are telling us that 644 people share a tap_in_home on average. Does that make sense?
No it doesnâ€™t, right?

Remember I told you a few important things that apply to tap_in_home and broken_tap_in_home? The surveyors combined the data of many households together and added this as a single tap record, but each household actually has its own tap. In addition to this, there is an average of 6 people living in a home. So 6 people actually share 1 tap (not 644).

Calculating the average number of people served by a single instance of each water source type helps us understand the typical capacity or load on a single water source. This can help us decide which sources should be repaired or upgraded, based on the average impact of each upgrade. For example, wells don't seem to be a problem, as fewer people are sharing them.

Now letâ€™s calculate the total number of people served by each type of water source in total, to make it easier to interpret, order them so the most people served by a source is at the top.

In [25]:
%%sql
SELECT
    type_of_water_source, SUM(number_of_people_served) AS total_number_of_people_served, ROUND(SUM(number_of_people_served) * 100 /(SELECT
                                                   SUM(number_of_people_served)
                                                FROM water_source),0) AS pct_number_of_people_served
FROM
    water_source
GROUP BY 1
ORDER BY 2 DESC

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+----------------------+-------------------------------+-----------------------------+
| type_of_water_source | total_number_of_people_served | pct_number_of_people_served |
+----------------------+-------------------------------+-----------------------------+
|      shared_tap      |            11945272           |              43             |
|         well         |            4841724            |              18             |
|     tap_in_home      |            4678880            |              17             |
|  tap_in_home_broken  |            3799720            |              14             |
|        river         |            2362544            |              9              |
+----------------------+-------------------------------+-----------------------------+

43% of our people are using shared taps in their communities, and on average, we saw earlier, that 2000 people share one shared_tap.

By adding tap_in_home and tap_in_home_broken together, we see that 31% of people have water infrastructure installed in their homes, but 45% (14/31) of these taps are not working! This isn't the tap itself that is broken, but rather the infrastructure like treatment plants, reservoirs, pipes, and pumps that serve these homes that are broken.

### START a SOLUTION
At some point, we will have to fix or improve all of the infrastructure, so we should start thinking about how we can make a data-driven decision how to do it. I think a simple approach is to fix the things that affect most people first. So let's write a query that ranks each type of source based on how many people in total use it. RANK() should tell you we are going to need a window function to do this, so let's think through the problem.

In [26]:
%%sql
SELECT
    type_of_water_source, ROUND(SUM(number_of_people_served),0) As people_served,
    RANK () OVER (ORDER BY SUM(number_of_people_served) DESC) as source_rank
FROM
    water_source
WHERE type_of_water_source != 'tap_in_home_broken'
GROUP BY 1
ORDER BY 3

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

4 rows affected.

+----------------------+---------------+-------------+
| type_of_water_source | people_served | source_rank |
+----------------------+---------------+-------------+
|      shared_tap      |    11945272   |      1      |
|         well         |    4841724    |      2      |
|     tap_in_home      |    4678880    |      3      |
|        river         |    2362544    |      4      |
+----------------------+---------------+-------------+

Ok, so we should fix shared taps first, then wells, and so on. But the next question is, which shared taps or wells should be fixed first? We can use the same logic; the most used sources should really be fixed first.
So create a query to do this, and keep these requirements in mind:
1. The sources within each type should be assigned a rank.
2. Limit the results to only improvable sources.
3. Think about how to partition, filter and order the results set.
4. Order the results to see the top of the list.

In [27]:
%%sql
SELECT
    source_id,
    type_of_water_source,
    number_of_people_served,
    DENSE_RANK() OVER (ORDER BY 
                     number_of_people_served DESC) AS priority_rank
FROM
    water_source
WHERE
    type_of_water_source != 'tap_in_home_broken'
LIMIT 10

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

10 rows affected.

+--------------+----------------------+-------------------------+---------------+
|  source_id   | type_of_water_source | number_of_people_served | priority_rank |
+--------------+----------------------+-------------------------+---------------+
| HaRu19509224 |      shared_tap      |           3998          |       1       |
| AkRu05603224 |      shared_tap      |           3998          |       1       |
| AkRu04862224 |      shared_tap      |           3996          |       2       |
| KiHa22867224 |      shared_tap      |           3996          |       2       |
| AmAs10911224 |      shared_tap      |           3996          |       2       |
| HaRu19839224 |      shared_tap      |           3994          |       3       |
| KiZu31330224 |      shared_tap      |           3994          |       3       |
| KiZu31415224 |      shared_tap      |           3992          |       4       |
| KiRu28630224 |      shared_tap      |           3992          |       4       |
| KiRu26218224 |      shared_tap      |           3990          |       5       |
+--------------+----------------------+-------------------------+---------------+

Use ROW_NUMBER for Detailed Ranking

In [29]:
%%sql
SELECT
    source_id,
    type_of_water_source,
    number_of_people_served,
    ROW_NUMBER() OVER (ORDER BY 
                     number_of_people_served DESC) AS priority_rank
FROM
    water_source
WHERE
    type_of_water_source != 'tap_in_home_broken'
LIMIT 5

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+--------------+----------------------+-------------------------+---------------+
|  source_id   | type_of_water_source | number_of_people_served | priority_rank |
+--------------+----------------------+-------------------------+---------------+
| HaRu19509224 |      shared_tap      |           3998          |       1       |
| AkRu05603224 |      shared_tap      |           3998          |       2       |
| AkRu04862224 |      shared_tap      |           3996          |       3       |
| KiHa22867224 |      shared_tap      |           3996          |       4       |
| AmAs10911224 |      shared_tap      |           3996          |       5       |
+--------------+----------------------+-------------------------+---------------+

### Analysing Queues

The visits table documented all of the visits our field surveyors made to each location. For most sources, one visit was enough, but if there were queues, they visited the location a couple of times to get a good idea of the time it took for people to queue for water. So we have the time that they collected the data, how many times the site was visited, and how long people had to queue for water.

So, look at the information we have available, and think of what we could learn from it. Remember we can use some DateTime functions here to get
some deeper insight into the water queueing situation in Maji Ndogo, like which day of the week it was, and what time.


Ok, these are some of the things I think are worth looking at:
1. How long did the survey take?
2. What is the average total queue time for water?
3. What is the average queue time on different days?
4. How can we communicate this information efficiently?

In [33]:
%%sql
SELECT
    *
FROM
    visits
LIMIT 
    5

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+
| record_id | location_id |  source_id   |    time_of_record   | visit_count | time_in_queue | assigned_employee_id |
+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+
|     0     |  SoIl32582  | SoIl32582224 | 2021-01-01 09:10:00 |      1      |       15      |          12          |
|     1     |  KiRu28935  | KiRu28935224 | 2021-01-01 09:17:00 |      1      |       0       |          46          |
|     2     |  HaRu19752  | HaRu19752224 | 2021-01-01 09:36:00 |      1      |       62      |          40          |
|     3     |  AkLu01628  | AkLu01628224 | 2021-01-01 09:53:00 |      1      |       0       |          1           |
|     4     |  AkRu03357  | AkRu03357224 | 2021-01-01 10:11:00 |      1      |       28      |          14          |
+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+

1. To calculate how long the survey took, we need to get the first and last dates (which functions can find the largest/smallest value), and subtract them. Remember with DateTime data, we can't just subtract the values. We have to use a function to get the difference in days.

In [36]:
%%sql
SELECT 
    TIMESTAMPDIFF(DAY, MIN(time_of_record), MAX(time_of_record)) AS project_duration
FROM visits

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+------------------+
| project_duration |
+------------------+
|       924        |
+------------------+

The project was completed in approximately 2 and half years

Question 2:
Let's see how long people have to queue on average in Maji Ndogo. Keep in mind that many sources like taps_in_home have no queues. These are just recorded as 0 in the time_in_queue column, so when we calculate averages, we need to exclude those rows. Try using NULLIF() do to this.

In [42]:
%%sql
SELECT
    AVG(NULLIF(time_in_queue,0)) as Avg_queue_time
FROM
    visits

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+----------------+
| Avg_queue_time |
+----------------+
|    123.2574    |
+----------------+

People spend over two hours in the queue

Question 3:
So let's look at the queue times aggregated across the different days of the week.


DAY() gives you the day of the month. It we want to aggregate data for each day of the week, we need to use another DateTime function, DAYNAME(column). As the name suggests, it returns the day from a timestamp as a string. Using that on the time_of_record column will result in a column with day names, Monday, Tuesday, etc., from the timestamp.

To do this, we need to calculate the average queue time, grouped by day of the week. Remember to revise DateTime functions, and also think about how to present the results clearly.

In [46]:
%%sql
SELECT
    DAYNAME(time_of_record) as day_of_week,
    ROUND (AVG(NULLIF(time_in_queue,0)),0) as Avg_queue_time
FROM
    visits
GROUP BY 
    1

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

7 rows affected.

+-------------+----------------+
| day_of_week | Avg_queue_time |
+-------------+----------------+
|    Friday   |      120       |
|   Saturday  |      246       |
|    Sunday   |       82       |
|    Monday   |      137       |
|   Tuesday   |      108       |
|  Wednesday  |       97       |
|   Thursday  |      105       |
+-------------+----------------+

People can spend over 6 hours on saturdays queuing for water in Maji Ndogo

Question 4:
We can also look at what time during the day people collect water. Try to order the results in a meaningful way.

In [51]:
%%sql
SELECT 
    HOUR(time_of_record) AS hour_of_day,
    ROUND (AVG(NULLIF(time_in_queue,0)),0) as Avg_queue_time

FROM 
    visits
GROUP BY 
    1
ORDER BY
    1 ASC

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

14 rows affected.

+-------------+----------------+
| hour_of_day | Avg_queue_time |
+-------------+----------------+
|      6      |      149       |
|      7      |      149       |
|      8      |      149       |
|      9      |      118       |
|      10     |      114       |
|      11     |      111       |
|      12     |      112       |
|      13     |      115       |
|      14     |      114       |
|      15     |      114       |
|      16     |      114       |
|      17     |      149       |
|      18     |      147       |
|      19     |      168       |
+-------------+----------------+

Most people fetched water around 7PM

In [53]:
%%sql
SELECT
    TIME_FORMAT (TIME (time_of_record),'%H:00') as hour_of_day,
    ROUND (AVG(NULLIF(time_in_queue,0)),0) as Avg_queue_time
FROM
    visits
GROUP BY 1
ORDER BY 1

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

14 rows affected.

+-------------+----------------+
| hour_of_day | Avg_queue_time |
+-------------+----------------+
|    06:00    |      149       |
|    07:00    |      149       |
|    08:00    |      149       |
|    09:00    |      118       |
|    10:00    |      114       |
|    11:00    |      111       |
|    12:00    |      112       |
|    13:00    |      115       |
|    14:00    |      114       |
|    15:00    |      114       |
|    16:00    |      114       |
|    17:00    |      149       |
|    18:00    |      147       |
|    19:00    |      168       |
+-------------+----------------+

The mornings and evenings are the busiest

In [64]:
%%sql
SELECT
    TIME_FORMAT(TIME(time_of_record), '%H:00') AS hour_of_day,
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Sunday' THEN time_in_queue
ELSE NULL
END
),0) AS Sunday,
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Monday' THEN time_in_queue
ELSE NULL
END
),0) AS Monday,
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Tuesday' THEN time_in_queue
ELSE NULL
END
),0) AS Tuesday,
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Wednesday' THEN time_in_queue
ELSE NULL
END
),0) AS Wednesday,
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Thursday' THEN time_in_queue
ELSE NULL
END
),0) AS Thursday,
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Friday' THEN time_in_queue
ELSE NULL
END
),0) AS Friday,
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Saturday' THEN time_in_queue
ELSE NULL
END
),0) AS Saturday
FROM
visits
WHERE
time_in_queue != 0 -- this excludes other sources with 0 queue times
GROUP BY
hour_of_day
ORDER BY
hour_of_day;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

14 rows affected.

There's a new jupysql version available (0.10.14), you're running 0.10.13. To upgrade: pip install jupysql --upgrade

+-------------+--------+--------+---------+-----------+----------+--------+----------+
| hour_of_day | Sunday | Monday | Tuesday | Wednesday | Thursday | Friday | Saturday |
+-------------+--------+--------+---------+-----------+----------+--------+----------+
|    06:00    |   79   |  190   |   134   |    112    |   134    |  153   |   247    |
|    07:00    |   82   |  186   |   128   |    111    |   139    |  156   |   247    |
|    08:00    |   86   |  183   |   130   |    119    |   129    |  153   |   247    |
|    09:00    |   84   |  127   |   105   |     94    |    99    |  107   |   252    |
|    10:00    |   83   |  119   |    99   |     89    |    95    |  112   |   259    |
|    11:00    |   78   |  115   |   102   |     86    |    99    |  104   |   236    |
|    12:00    |   78   |  115   |    97   |     88    |    96    |  109   |   239    |
|    13:00    |   81   |  122   |    97   |     98    |   101    |  115   |   242    |
|    14:00    |   83   |  127   |   104   |     92    |    96    |  110   |   244    |
|    15:00    |   83   |  126   |   104   |     88    |    92    |  110   |   248    |
|    16:00    |   83   |  127   |    99   |     90    |    99    |  109   |   251    |
|    17:00    |   79   |  181   |   135   |    121    |   129    |  151   |   251    |
|    18:00    |   80   |  174   |   122   |    113    |   132    |  158   |   240    |
|    19:00    |  127   |  159   |   145   |    176    |   137    |  103   |   282    |
+-------------+--------+--------+---------+-----------+----------+--------+----------+

See if you can spot these patterns:
1. Queues are very long on a Monday morning and Monday evening as people rush to get water.
2. Wednesday has the lowest queue times, but long queues on Wednesday evening.
3. People have to queue pretty much twice as long on Saturdays compared to the weekdays. It looks like people spend their Saturdays queueing
for water, perhaps for the week's supply?
4. The shortest queues are on Sundays, and this is a cultural thing. The people of Maji Ndogo prioritise family and religion, so Sundays are spent
with family and friends.

1. If communities are using rivers, we can dispatch trucks to those regions to provide water temporarily in the short term, while we send out
crews to drill for wells, providing a more permanent solution.
2. If communities are using wells, we can install filters to purify the water. For wells with biological contamination, we can install UV filters that
kill microorganisms, and for *polluted wells*, we can install reverse osmosis filters. In the long term, we need to figure out why these sources
are polluted.
3. For shared taps, in the short term, we can send additional water tankers to the busiest taps, on the busiest days. We can use the queue time
pivot table we made to send tankers at the busiest times. Meanwhile, we can start the work on installing extra taps where they are needed.
According to UN standards, the maximum acceptable wait time for water is 30 minutes. With this in mind, our aim is to install taps to get
queue times below 30 min.
4. Shared taps with short queue times (< 30 min) represent a logistical challenge to further reduce waiting times. The most effective solution,
installing taps in homes, is resource-intensive and better suited as a long-term goal.
5. Addressing broken infrastructure offers a significant impact even with just a single intervention. It is expensive to fix, but so many people
can benefit from repairing one facility. For example, fixing a reservoir or pipe that multiple taps are connected to. We will have to find the
commonly affected areas though to see where the problem actually is.

### Integrated project: Maji Ndogo part 2 [MCQ]

1. Which SQL query will produce the date format "DD Month YYYY" from the time_of_record column in the visits table, as a single column? Note: Monthname() acts in a similar way to DAYNAME().

In [68]:
%%sql
SELECT 
    CONCAT(day(time_of_record), " ", monthname(time_of_record), " ", year(time_of_record)) AS Standard_date
FROM 
   visits
LIMIT 5

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+----------------+
| Standard_date  |
+----------------+
| 1 January 2021 |
| 1 January 2021 |
| 1 January 2021 |
| 1 January 2021 |
| 1 January 2021 |
+----------------+

2. You are working with an SQL query designed to calculate the Annual Rate of Change (ARC) for basic rural water services:

SELECT

name,

wat_bas_r - LAG(wat_bas_r) OVER (PARTITION BY (a) ORDER BY (b)) 

FROM 

global_water_access

ORDER BY

name;

To accomplish this task, what should you use for placeholders (a) and (b)?

In [70]:
%%sql
# Q2
SELECT
    name,
    wat_bas_r - LAG(wat_bas_r) OVER (PARTITION BY name ORDER BY year) AS ARC 
FROM 
    global_water_access
ORDER BY
     name
LIMIT 5

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+-------------+--------------------+
|     name    |        ARC         |
+-------------+--------------------+
| Afghanistan |        None        |
| Afghanistan | 13.339405059814453 |
|   Albania   |        None        |
|   Albania   | 3.4641036987304688 |
|   Algeria   |        None        |
+-------------+--------------------+

3. What are the names of the two worst-performing employees who visited the fewest sites, and how many sites did the worst-performing employee visit? Modify your queries from the â€œHonouring the workersâ€ section.

In [73]:
%%sql
SELECT
    assigned_employee_id,
    COUNT(visit_count) AS num_of_visits
FROM
    visits
GROUP BY
    assigned_employee_id
ORDER BY
    num_of_visits ASC
LIMIT
    2

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2 rows affected.

+----------------------+---------------+
| assigned_employee_id | num_of_visits |
+----------------------+---------------+
|          20          |       15      |
|          22          |      143      |
+----------------------+---------------+

In [74]:
%%sql
SELECT 
    employee_name
FROM 
    employee
WHERE 
    assigned_employee_id IN (20, 22)

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2 rows affected.

+---------------+
| employee_name |
+---------------+
|   Kunto Asha  |
|  Lesedi Kofi  |
+---------------+

4. What does the following query do?

In [76]:
%%sql
SELECT 
    location_id,
    time_in_queue,
    AVG(time_in_queue) OVER (PARTITION BY location_id ORDER BY visit_count) AS total_avg_queue_time
FROM 
    visits
WHERE 
visit_count > 1 -- Only shared taps were visited > 1
ORDER BY 
    location_id, time_of_record
LIMIT 
    5

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+-------------+---------------+----------------------+
| location_id | time_in_queue | total_avg_queue_time |
+-------------+---------------+----------------------+
|  AkHa00036  |      113      |       113.0000       |
|  AkHa00036  |      229      |       171.0000       |
|  AkHa00036  |      400      |       247.3333       |
|  AkHa00036  |      120      |       215.5000       |
|  AkHa00036  |      185      |       209.4000       |
+-------------+---------------+----------------------+

It computes an average queue time for shared taps visited more than once, which is updated each time a source is visited.

5. One of our employees, Farai Nia, lives at 33 Angelique Kidjo Avenue. What would be the result if we TRIM() her address?

TRIM('33 Angelique Kidjo Avenue  ')

In [78]:
%%sql
SELECT 
 TRIM('33 Angelique Kidjo Avenue  ') AS trim_result

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+---------------------------+
|        trim_result        |
+---------------------------+
| 33 Angelique Kidjo Avenue |
+---------------------------+

6. How many employees live in Dahabu? Rely on one of the queries we used in the project to answer this.

In [79]:
%%sql
SELECT
    town_name,
    COUNT(assigned_employee_id) AS number_of_employees
FROM
    employee
WHERE town_name='Dahabu'
GROUP BY
    town_name
LIMIT 
    5

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+-----------+---------------------+
| town_name | number_of_employees |
+-----------+---------------------+
|   Dahabu  |          6          |
+-----------+---------------------+

6. How many employees live in Harare, Kilimani? Modify one of your queries from the project to answer this question.

In [82]:
%%sql
SELECT
    COUNT(*) AS num_of_employees
FROM
    employee
where
    province_name = 'Kilimani'
    AND town_name = 'Harare'

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+------------------+
| num_of_employees |
+------------------+
|        2         |
+------------------+

8. How many people share a well on average? Round your answer to 0 decimals.

In [84]:
%%sql
SELECT
    ROUND(AVG(number_of_people_served),0) AS Avg_people_served
FROM 
    water_source
WHERE
    type_of_water_source ='well'

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+-------------------+
| Avg_people_served |
+-------------------+
|        279        |
+-------------------+

10. Consider the query we used to calculate the total number of people served:

In [88]:
%%sql
SELECT
    type_of_water_source,
    SUM(number_of_people_served) AS population_served
FROM
    water_source
WHERE type_of_water_source LIKE "%tap%"
GROUP BY 1
ORDER BY
    2 DESC

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+----------------------+-------------------+
| type_of_water_source | population_served |
+----------------------+-------------------+
|      shared_tap      |      11945272     |
|     tap_in_home      |      4678880      |
|  tap_in_home_broken  |      3799720      |
+----------------------+-------------------+

Which of the following lines of code will calculate the total number of people using some sort of tap?WHERE type_of_water_source LIKE "%tap%"

Use the pivot table we created to answer the following question. What are the average queue times for the following times?

Saturday from 12:00 to 13:00

Tuesday from 18:00 to 19:00

Sunday from 09:00 to 10:00

Ans: Saturday: 239, Tuesday: 122, Sunday: 84